def chocolate_maker(small, big, x):
    small_cm = 1*small
    print(small_cm)
    big_cm = 3*big
    print(big_cm)
    if small_cm+big_cm == x:
        print(True)
    else:
        print(False)
chocolate_maker( 2, 2, 8)

"""ברצוננו לחבר קוביות שוקולד לשורה שאורכה x ס"מ.
ברשותנו קוביות שוקולד קטנות באורך 1 ס"מ וקוביות שוקולד גדולות באורך 5 ס"מ.
לצורך המשימה כתבו פונקציה שנקראת chocolate_maker המוגדרת כך:

הפונקציה מקבלת את מספר הקוביות הקטנות (small), את מספר הקוביות הגדולות (big) ואת אורך השורה הרצוי (x).
הפונקציה מחזירה אמת אם אפשר ליצור שורה באורך x באמצעות מספר קוביות השוקולד שקיבלה, כולן או חלקן.
"""