def inverse_dict(my_dict):
    pass

"""הפונקציה מקבלת כפרמטר מילון.
הפונקציה מחזירה מילון חדש עם מיפוי "הפוך": כל מפתח במילון שמועבר הוא ערך במילון שמוחזר וכל ערך במילון שמועבר הוא מפתח במילון שמוחזר.

הנחיות
ההיפוך בין מפתחות לבין ערכים עלול ליצור מפתחות שמופיעים יותר מפעם אחת. לכן, יצגו את הערכים במילון שמוחזר כרשימה, שעשויה להכיל ערך אחד או יותר.
הרשימות המוחזרות צריכות להיות ממוינות (אפשר להניח שהערכים במילון הם מאותו הטיפוס).
בפרק האחרון הכרתם מספר פעולות בעבודה עם אובייקטים מטיפוס מילון. בתרגיל זה קראו באינטרנט על מתודות שימושיות בעבודה עם מילון וחקרו בעצמכם פעולות נוספות.
דוגמה להרצה של הפונקציה inverse_dict
>>> course_dict = {'I': 3, 'love': 3, 'self.py!': 2}
>>> inverse_dict(course_dict)
{3: ['I', 'love'], 2: ['self.py!']}"""